---
kind: method
id: M:Autodesk.Revit.DB.ExternallyTaggedNonBReps.#ctor
source: html/7b517bb0-5ea2-cd1d-4cf4-053cae84f2bf.htm
---
# Autodesk.Revit.DB.ExternallyTaggedNonBReps.#ctor Method

Make a new empty collection of ExternallyTaggedNonBRep instances.

## Syntax (C#)
```csharp
public ExternallyTaggedNonBReps()
```